wallFunction/testCase2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    
 inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          (0 0 0);
        value           nonuniform List<vector> 
479
(
(0.5262	0.0000	0.0000)
(0.5882	0.0000	0.0000)
(0.6245	0.0000	0.0000)
(0.6502	0.0000	0.0000)
(0.6701	0.0000	0.0000)
(0.6864	0.0000	0.0000)
(0.7002	0.0000	0.0000)
(0.7122	0.0000	0.0000)
...
);
    }
   outlet
   {
        type            zeroGradient;
    }
   top
    {
        type            zeroGradient; 
    }

    fixedWalls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
