wallFunction/testCase2/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 9.12870929175277E-006;

boundaryField
{
   inlet
   {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
        value           nonuniform List<scalar> 
479
(
0.1204966218
0.0603652702
0.0403070257
0.0302672682
0.0242350723
0.0202067953
0.0173237322
0.0151565297
...
9.12870929175277E-006

)
;
    }
   outlet
   {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            epsilonOngWallFunction;
        value           uniform 0.12;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
