wallFunction/testCase2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
     inlet
   {
        
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
        value           nonuniform List<scalar> 
479
(
0.0044363754
0.0043919007
0.0043476501
0.0043036235
0.0042598211
0.0042162426
0.0041728882
0.0041297579
...
)
;
    }
   outlet
   {
        type            zeroGradient;
    }

    top
    {
        type           zeroGradient; 
    }
    fixedWalls
    {
        type            kOngWallFunction;
        value           uniform 0.004481;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
