wallFunction/testCase2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    inlet
   {
      type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
        value           nonuniform List<scalar> 
479
(
1.47002326781327E-005
2.87581130434783E-005
4.22056824228029E-005
5.50728859813084E-005
6.73877413793104E-005
7.91764914027149E-005
9.04637423162583E-005
0.0001012726
...
9.85900603509299E-005

)
;
    }
   outlet
   {
         type             zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            nutOngWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
